{
  "nodes": [
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "mask", 
      "inputs": []
    }, 
    {
      "op": "broadcast_mul", 
      "name": "part_event_y", 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "start_1_conv_weight", 
      "attrs": {
        "kernel": "(1, 5)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 2)", 
        "stride": "(1, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "start_1_conv", 
      "attrs": {
        "kernel": "(1, 5)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 2)", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[3, 0, 0], [4, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "start_1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "start_1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "start_1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "start_1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "start_1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[5, 0, 0], [6, 0, 0], [7, 0, 0], [8, 0, 1], [9, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "start_1_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[10, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "res_start_avg_pool", 
      "attrs": {
        "global_pool": "0", 
        "kernel": "(1, 2)", 
        "pad": "(0, 0)", 
        "pool_type": "avg", 
        "pooling_convention": "valid", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[11, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_1_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [13, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_1_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[14, 0, 0], [15, 0, 0], [16, 0, 0], [17, 0, 1], [18, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_1_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[19, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_1_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[20, 0, 0], [21, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_1_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[22, 0, 0], [23, 0, 0], [24, 0, 0], [25, 0, 1], [26, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_1_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[27, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_1_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[28, 0, 0], [29, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_1_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_1_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_1_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[30, 0, 0], [31, 0, 0], [32, 0, 0], [33, 0, 1], [34, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "branch_1_1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "branch_1_1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[12, 0, 0], [36, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "branch_1_1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_1_1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_1_1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_1_1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "branch_1_1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[37, 0, 0], [38, 0, 0], [39, 0, 0], [40, 0, 1], [41, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_1_1_add", 
      "inputs": [[35, 0, 0], [42, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_1_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[43, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_2_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[44, 0, 0], [45, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_2_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[46, 0, 0], [47, 0, 0], [48, 0, 0], [49, 0, 1], [50, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_2_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[51, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_2_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[52, 0, 0], [53, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_2_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[54, 0, 0], [55, 0, 0], [56, 0, 0], [57, 0, 1], [58, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_2_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[59, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_2_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[60, 0, 0], [61, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_2_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_2_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_2_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[62, 0, 0], [63, 0, 0], [64, 0, 0], [65, 0, 1], [66, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_1_2_add", 
      "inputs": [[67, 0, 0], [44, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_2_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[68, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_3_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[69, 0, 0], [70, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_3_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[71, 0, 0], [72, 0, 0], [73, 0, 0], [74, 0, 1], [75, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_3_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[76, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_3_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "32", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[77, 0, 0], [78, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_3_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[79, 0, 0], [80, 0, 0], [81, 0, 0], [82, 0, 1], [83, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_3_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[84, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_1_3_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "128", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[85, 0, 0], [86, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_1_3_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_1_3_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_1_3_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[87, 0, 0], [88, 0, 0], [89, 0, 0], [90, 0, 1], [91, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_1_3_add", 
      "inputs": [[92, 0, 0], [69, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_1_3_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[93, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_1_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[94, 0, 0], [95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_1_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0], [98, 0, 0], [99, 0, 1], [100, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_1_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[101, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_1_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[102, 0, 0], [103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_1_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0], [106, 0, 0], [107, 0, 1], [108, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_1_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[109, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_1_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[110, 0, 0], [111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_1_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_1_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_1_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0], [114, 0, 0], [115, 0, 1], [116, 0, 1]]
    }, 
    {
      "op": "null", 
      "name": "branch_2_1_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "branch_2_1_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[94, 0, 0], [118, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "branch_2_1_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_2_1_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_2_1_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "branch_2_1_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "branch_2_1_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[119, 0, 0], [120, 0, 0], [121, 0, 0], [122, 0, 1], [123, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_2_1_add", 
      "inputs": [[117, 0, 0], [124, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_1_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[125, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_2_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[126, 0, 0], [127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_2_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0], [130, 0, 0], [131, 0, 1], [132, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_2_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[133, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_2_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[134, 0, 0], [135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_2_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0], [138, 0, 0], [139, 0, 1], [140, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_2_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[141, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_2_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[142, 0, 0], [143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_2_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_2_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_2_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0], [146, 0, 0], [147, 0, 1], [148, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_2_2_add", 
      "inputs": [[149, 0, 0], [126, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_2_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[150, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_3_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[151, 0, 0], [152, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_3_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[153, 0, 0], [154, 0, 0], [155, 0, 0], [156, 0, 1], [157, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_3_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[158, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_3_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[159, 0, 0], [160, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_3_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[161, 0, 0], [162, 0, 0], [163, 0, 0], [164, 0, 1], [165, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_3_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[166, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_2_3_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[167, 0, 0], [168, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_2_3_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_2_3_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_2_3_restore_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[169, 0, 0], [170, 0, 0], [171, 0, 0], [172, 0, 1], [173, 0, 1]]
    }, 
    {
      "op": "elemwise_add", 
      "name": "res_2_3_add", 
      "inputs": [[174, 0, 0], [151, 0, 0]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_2_3_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_reduce_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_3_1_reduce_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 0)", 
        "stride": "(1, 2)"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_reduce_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_reduce_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_reduce_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_reduce_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_3_1_reduce_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_3_1_reduce_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_standard_conv_weight", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_3_1_standard_conv", 
      "attrs": {
        "kernel": "(1, 3)", 
        "no_bias": "1", 
        "num_filter": "64", 
        "pad": "(0, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_standard_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_standard_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_standard_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_standard_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "res_3_1_standard_bn", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "LeakyReLU", 
      "name": "res_3_1_standard_relu", 
      "attrs": {
        "act_type": "leaky", 
        "slope": "0.2"
      }, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_restore_conv_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "res_3_1_restore_conv", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "1", 
        "num_filter": "256", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "res_3_1_restore_bn_gamma", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_restore_bn_beta", 
      "attrs": {
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_restore_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "res_3_1_restore_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "eps": "0.0001", 
        "fix_gamma": "0", 
        "momentum": "0.9", 
        "use_global_stats": "0"
      }, 
      "inputs": []
    }, 
    {
